# Project 3 Part 3 ETL (CORE)
**Marco Jimenez 7/11/2022**

In [106]:
# Imports & Libraries
import json
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats
# MySQL
import pymysql
pymysql.install_as_MySQLdb()
# SqlAlchemy
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

# Extracting Data

In [107]:
# Reading in dataframes
basics = pd.read_csv('Data/title_basics.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

# Transforming data

## Tmdb table

In [108]:
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1884.0,PG

In [109]:
# Making tmdb dataframe with requested columns 
tmdb = tmdb[['imdb_id','revenue','budget','certification']]
tmdb.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

## Title basics table

In [110]:
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"
...,...,...,...,...,...,...,...,...,...
81440,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama
81441,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy"
81442,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
81443,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller"
81444,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

In [111]:
# Splitting the genres column
basics['genres_split'] = basics['genres'].str.split(',')
# Exploding the created column
genres_exploded = basics.explode('genres_split')
# Confirming transformation
genres_exploded

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81443,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
81443,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
81443,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
81444,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
81444,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [112]:
# Dropping genres column and other unneccesary columns
basics = basics.drop(columns=['originalTitle','isAdult','titleType','genres'])
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,[Drama]
2,tt0069049,The Other Side of the Wind,2018,NaN,122,[Drama]
3,tt0088751,The Naked Monster,2005,NaN,100,"[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020,NaN,74,"[Horror, Music, Thriller]"
...,...,...,...,...,...,...
81440,tt9914942,Life Without Sara Amat,2019,NaN,74,[Drama]
81441,tt9915872,The Last White Witch,2019,NaN,97,"[Comedy, Drama, Fantasy]"
81442,tt9916170,The Rehearsal,2019,NaN,51,[Drama]
81443,tt9916190,Safeguard,2020,NaN,90,"[Action, Adventure, Thriller]"
81444,tt9916362,Coven,2020,NaN,92,"[Drama, History]"

## Title genres table

In [113]:
# Getting the unqigue genres & sorting the malphabetically
unique_genres = sorted(genres_exploded['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [114]:
# Saving tconst and genres_split column as a new dataframe table
title_genres = genres_exploded[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Genres table

In [115]:
# Making a mapper dictionary for the title_genres table
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [116]:
# Making new integer genre_id and dropping string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [117]:
# Converting genre map dict to a dataframe
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                             'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Creating a datatype schema

In [118]:
# Looking at tconst dtype
basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
genres_split       object
dtype: object

In [119]:
# Getting max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
# Schema dictionary using sqlalchemy dtypes
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

# Loading Data

In [120]:
# loading mysql credentials
with open('/Users/LP-Ca/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['root'])

In [121]:
# Creating connection to database
connection = "mysql+pymysql://root:root@localhost/Movies"
# Creating engine
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/Movies)

In [122]:
# Checking if the database exists
if database_exists(connection):
    print('Already exists')
else:
    create_database(connection)
    print('Database created')

Already exists

## Creating tables

In [137]:
basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)

OperationalError: (pymysql.err.OperationalError) (1241, 'Operand should contain 1 column(s)')
[SQL: INSERT INTO title_basics (tconst, `primaryTitle`, `startYear`, `endYear`, `runtimeMinutes`, genres_split) VALUES (%(tconst)s, %(primaryTitle)s, %(startYear)s, %(endYear)s, %(runtimeMinutes)s, %(genres_split)s)]
[parameters: ({'tconst': 'tt0035423', 'primaryTitle': 'Kate & Leopold', 'startYear': 2001, 'endYear': None, 'runtimeMinutes': 118, 'genres_split': ['Comedy', 'Fantasy', 'Romance']}, {'tconst': 'tt0062336', 'primaryTitle': 'The Tango of the Widower and Its Distorting Mirror', 'startYear': 2020, 'endYear': None, 'runtimeMinutes': 70, 'genres_split': ['Drama']}, {'tconst': 'tt0069049', 'primaryTitle': 'The Other Side of the Wind', 'startYear': 2018, 'endYear': None, 'runtimeMinutes': 122, 'genres_split': ['Drama']}, {'tconst': 'tt0088751', 'primaryTitle': 'The Naked Monster', 'startYear': 2005, 'endYear': None, 'runtimeMinutes': 100, 'genres_split': ['Comedy', 'Horror', 'Sci-Fi']}, {'tconst': 'tt0093119', 'primaryTitle': 'Grizzly II: Revenge', 'startYear': 2020, 'endYear': None, 'runtimeMinutes': 74, 'genres_split': ['Horror', 'Music', 'Thriller']}, {'tconst': 'tt0094859', 'primaryTitle': 'Chief Zabu', 'startYear': 2016, 'endYear': None, 'runtimeMinutes': 74, 'genres_split': ['Comedy']}, {'tconst': 'tt0096056', 'primaryTitle': 'Crime and Punishment', 'startYear': 2002, 'endYear': None, 'runtimeMinutes': 126, 'genres_split': ['Drama']}, {'tconst': 'tt0100275', 'primaryTitle': 'The Wandering Soap Opera', 'startYear': 2017, 'endYear': None, 'runtimeMinutes': 80, 'genres_split': ['Comedy', 'Drama', 'Fantasy']}  ... displaying 10 of 81445 total bound parameter sets ...  {'tconst': 'tt9916190', 'primaryTitle': 'Safeguard', 'startYear': 2020, 'endYear': None, 'runtimeMinutes': 90, 'genres_split': ['Action', 'Adventure', 'Thriller']}, {'tconst': 'tt9916362', 'primaryTitle': 'Coven', 'startYear': 2020, 'endYear': None, 'runtimeMinutes': 92, 'genres_split': ['Drama', 'History']})]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [141]:
# Saving tables to database with dtype and index=False
ratings.to_sql('title_ratings', engine, if_exists='replace')
title_genres.to_sql('title_genres', engine, if_exists='replace')
genre_lookup.to_sql('genres', engine, if_exists='replace')
tmdb.to_sql('tmdb_data', engine, if_exists='replace')

In [146]:
# Updating primary keys
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [129]:
# Confirming that the tables were created
q = """
SHOW TABLES
"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [135]:
# Displaying first 5 rows of genres table
q = """
SELECT *
FROM genres
LIMIT 5;
"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [136]:
# Displaying first 5 rows of title_basics
q = """
SELECT *
FROM title_basics
LIMIT 5;
"""
pd.read_sql(q, engine)

Empty DataFrame
Columns: [tconst, primaryTitle, startYear, endYear, runtimeMinutes, genres_split]
Index: []

In [138]:
# Displaying first 5 rows of title_genres
q = """
SELECT *
FROM title_genres
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [139]:
# Displaying first 5 rows of title_ratings
q = """
SELECT *
FROM title_ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1891
1  tt0000002            5.9       252
2  tt0000003            6.5      1681
3  tt0000004            5.7       165
4  tt0000005            6.2      2499

In [143]:
# Displaying first 5 rows of tmdb_data
q = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q, engine)

   index    imdb_id     revenue      budget certification
0      0          0         NaN         NaN          None
1      1  tt0113026         0.0  10000000.0          None
2      2  tt0113092         0.0         0.0          None
3      3  tt0116391         0.0         0.0          None
4      4  tt0118694  12854953.0    150000.0            PG